import numpy as np                  # 导入 NumPy 库
list_1 = [1,2,3,4]                  # 创建列表
list_2 = [[1,2,3,4],[5,6,7,8]]      # 创建列表
arr_1=np.array(list_1)              # 创建一维数组
arr_2=np.array(list_2)              # 创建二维数组
print('一维数组为\n',arr_1)
print('二维数组为\n',arr_2)
# 运行结果:
# 一维数组为
# [1 2 3 4]
# 二维数组为
# [[1 2 3 4]
# [5 6 7 8]]

# 1.使用arange函数创建数组

# arange()生成0-5范围内，步长为1的数组
import numpy as np                  # 导入 NumPy 库
a = np.arange(0, 6, 1, dtype=int)  # 执行数组中的数据类型为整数类型
print (a)
# 运行结果:
# [0 1 2 3 4 5]

# 2.使用linspace创建数组
import numpy as np                  # 导入 NumPy 库
print(np.linspace(0,1,10))# 此时步长为总长的 1/9
# 运行结果:
# array ([0.        , 0.11111111, 0.22222222, 0.33333333, 0.44444444,
#         0.55555556, 0.66666667, 0.77777778, 0.88888889, 1.         ])

# 3.使用logspace函数创建数组
import numpy as np                  # 导入 NumPy 库
print(np.logspace(0, 1, 10))
# 运行结果：
# array（[ 1.        , 1.29154967, 1.66810054, 2.15443469, 2.7825594 ,
#          3.59381366, 4.64158883, 5.9948425 , 7.74263683, 10.       ])

# 4.创建指定形状和类型的数组
import numpy as np                  # 导入 NumPy 库
zero = np.zeros(5)                  # 创建元素个数为5的全0数组
one = np.ones (5)                   # 创建元素个数为5的全1数组
empty = np.empty (10)               # 创建元素个数为10的空值(未初始化)数组
print("元素个数为5的全0数组：\n",zero)
print("元素个数为5的全1数组：\n",one)
print("元素个数为10的空值数组：\n",empty)
# 运行结果:
# 元素个数为5的全0数组：
# [0. 0. 0. 0. 0.]
# 元素个数为5的全1数组：
# [1. 1. 1. 1. 1.]
# 元素个数为10的空值数组：
#  [ 1.          1.29154967  1.66810054  2.15443469  2.7825594   3.59381366
#   4.64158883  5.9948425   7.74263683 10.        ]

