import numpy as np

# 1.数组的形状
a = np.int32(100*np.random.random((3, 4))) # 生成3X4整数数组
print(repr(a))
# 输出:
# array([[41,  5, 78, 29],
#        [65, 17, 48, 97],
#        [20, 92, 48, 14]], dtype=int32)
print(a.shape)
# 输出:
# (3,4)

# 2.1展开数组
a = np.int32(100*np.random.random( (3, 4))) # 生成3X4整数数组
print(a.ravel())
# 输出:
# [ 0 41 65 79  7 20 10 94 17 31 13 73]

# 2.2调整数组形状
a.shape = (6, 2)                            # 将数组形状改为(6,2)
print(repr(a))
# 输出:
# array([[ 0, 41],
#        [65, 79],
#        [ 7, 20],
#        [10, 94],
#        [17, 31],
#        [13, 73]], dtype=int32)
#
b = a.reshape((3, 4))                      # 返回一个新的形状为(3,4)的数组
print(repr(b))
# 输出:
# array([[ 0, 41, 65, 79],
#        [ 7, 20, 10, 94],
#        [17, 31, 13, 73]], dtype=int32)

# 2.3转置数组
print(repr(a.transpose()))
# 输出:
# array([[ 0, 65,  7, 10, 17, 13],
#        [41, 79, 20, 94, 31, 73]], dtype=int32)

# 2.4使用-1自动计算维度（通过总元素个数/已指定的维度得到-1所代表的维度值，只允许有一个-1）
a = np.array([[1, 2, 3], [4, 5, 6]])
print(np.reshape(a, (3, -1)))       # 自动计算列数为2
# 输出:[[1 2]
#  [3 4]
#  [5 6]]

# 2.5resize函数于reshape函数的区别
a = np.array([[0, 1], [2, 3]])
a.resize(2, 3)                  # 直接修改原数组的形状
print (a)
# 输出:
# [[0 1 2]
#  [3 0 0]]                     # 用零填充


