# 1.索引
# （1）一维数组的索引
import numpy as np
new_arr1 = np.array([0, 2, 5])
print (new_arr1[1])             # 获取数组索引为1的元素
# 运行结果:2

# （2）二维数组的索引
new_arr1 = np.array([[0, 2, 5], [4, 6, 7]])
print (new_arr1[1, 2])         # 获取第二行的第三个元素
# 运行结果为:
# 7

# 2.切片式索引
# （1）一维数组的切片式索引
new_arr1 = np.array ([0, 2, 0, 4, 1, 6])
print (new_arr1[0:3] )         # 输出数组第1个至第3个元素
print (new_arr1[1: ])          # 输出数组从第2个元素到最后的所有元素
print (new_arr1[ :3])          # 输出数组第4个元素之前的所有元素
print (new_arr1[0:5:2])        # 从第 1个到第5个以步长2输出元素
print (new_arr1[-1 ::- 2])     # 从倒数第1个到第1个以步长-2输出元素
# 运行结果为:
# [0 2 0]
# [2 0 4 1 6]
# [0 2 0]
# [0 0 1]
# [6 4 2]

# （2）二维数组的切片式索引
arr = np.array([np.arange(1, 8), np.arange(4, 11), np.arange(8, 15)]) # 创建了3行7列的二维数组
print (arr)                 # 输出创建的数组
print (arr[2] )             # 输出第3行的元素
print (arr[2, 3])           # 输出第3行第4列的元素
print (arr[ :2, :3])        # 输出第1行至第2行的第1列至第3列的元素
print (arr[:, :3])          # 输出所有行的第1列至第3列的元素
# 运行结果为:
# [[ 1  2  3  4  5  6  7]
#  [ 4  5  6  7  8  9 10]
#  [ 8  9 10 11 12 13 14]]

# [ 8  9 10 11 12 13 14]

# 11

# [[1 2 3]
#  [4 5 6]]

# [[ 1  2  3]
#  [ 4  5  6]
#  [ 8  9 10]]

# 3.花式索引
arr = np.arange(25).reshape((5,5))
print (arr)
print (arr[[1,3,4]])
print (arr[[1,3,4], [2,3,4]]) # 等价于np.array([arr[1,2], arr[3,3], arr[4,4]])
# 运行结果为:
# [[ 0 1 2 3 4]
# [ 5 6 7 8 9]
# [10 11 12 13 14]
# [15 16 17 18 19]
# [20 21 22 23 24]]

# [[ 5 6 7 8 9]
# [15 16 17 18 19]
# [20 21 22 23 24]]

# [ 7 18 24]

# 4.布尔索引
arr = np.arange(8)      # 创建长度为8的数组
boolarr = np.array([True, False, False, True, True, True, False, True, ])   # 规定哪些元素为真值
print (arr[boolarr])    # 输出为真值的元素
# 运行结果为:
# [0 3 4 5 7]







