import numpy as np

# 创建一个数组
a = np.arange(10)
print("原数组：",a)
# 输出:
# 原数组： [0 1 2 3 4 5 6 7 8 9]

# 将数组重复2次
print("重复2次后的数组：",np.tile(a,2))
# 输出:
# 重复2次后的数组： [0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9]

# 将数组按行重复3次,按列重复2次
print("按行重复3次,按列重复2次后的数组：")
print (np.tile(a, (3, 2)))
# 输出:
# 按行重复3次,按列重复2次后的数组：
# [[0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9]
#  [0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9]
#  [0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9]]

# 将二维数组重复2次
a = np.arange(10).reshape(2, 5)             # 变形为2行5列的数组
print("二维数组重复2次后的结果：")
print (np.tile(a, 2))
# 输出:
# 二维数组重复2次后的结果：
# [[0 1 2 3 4 0 1 2 3 4]
#  [5 6 7 8 9 5 6 7 8 9]]
