import numpy as np

# 生成数组[0,1,2,3,4]
a = np.arange(5)
print('原数组:',a)
# 输出:
# 原数组: [0 1 2 3 4]

# 使用np.repeat进行数组重复(将数组a中的每个元素重复3次)
w = np.repeat(a, 3)
print('重复数据处理:\n',w)
# 输出:
# 重复数据处理:
# [0 0 0 1 1 1 2 2 2 3 3 3 4 4 4]

# 定义二维数组
a2 = np.array([[1, 2, 3], [4, 5, 6]])

# 重复数组的行(将每行重复2次)
print('重复数据处理1(按行重复):\n', a2.repeat(2, axis = 0))
# 输出:
# 重复数据处理1(按行重复):
# [[1 2 3]
#  [1 2 3]
#  [4 5 6]
#  [4 5 6]]

# 重复数组的列(将每列重复2次)
print('重复数据处理2(按列重复):\n', a2.repeat(2, axis = 1))
# 输出:
# 重复数据处理2(按列重复):
# [[1 1 2 2 3 3]
#  [4 4 5 5 6 6]]