import numpy as np

# 3.1矩阵的转置
mat = np.matrix( [[1, 2], [3, 4], [7, 8], [5, 6]])
print("转置前为:\n",mat)
print("转置后为:\n",mat.T)
# 输出:
# 转置前为:
# [[1 2]
#  [3 4]
#  [7 8]
#  [5 6]]
# 转置后为:
# [[1 3 7 5]
#  [2 4 8 6]]

# 3.2矩阵的求逆
#创建一个3×3的方阵
mat1 = np.matrix([[1, 2, 3], [4, 5, 6], [7, 8, 10]])
# 创建一个4×2的非方阵
mat2 = np.matrix([[1, 2], [3, 4], [7, 8], [5, 6]])

print("求逆前为:\n",mat1)
print("求逆后为:\n",mat1.I)
# 输出:
# 求逆前为:
# [[ 1  2  3]
#  [ 4  5  6]
#  [ 7  8 10]]
# 求逆后为:
# [[-0.66666667 -1.33333333  1.        ]
#  [-0.66666667  3.66666667 -2.        ]
#  [ 1.         -2.          1.        ]]

print("求逆前为:\n",mat2)
print("求逆后为:\n",mat2.I)
# 输出:
# 求逆前为:
# [[1 2]
#  [3 4]
#  [7 8]
#  [5 6]]
# 求逆后为:
# [[-1.00000000e+00 -5.00000000e-01  5.00000000e-01  3.71230824e-16]
#  [ 8.50000000e-01  4.50000000e-01 -3.50000000e-01  5.00000000e-02]]